src/test/resources/performancetest/html-report/statistics.json
{
  "GET error.txt" : {
    "transaction" : "GET error.txt",
    "sampleCount" : 469,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.4669509594882708,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 5.0,
    "throughput" : 0.02487186745723497,
    "receivedKBytesPerSec" : 0.011362404318217566,
    "sentKBytesPerSec" : 0.003618325983714177
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1348,
    "errorCount" : 5,
    "errorPct" : 0.37091988,
    "meanResTime" : 704.0927299703264,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 9045.0,
    "pct1ResTime" : 2318.2000000000003,
    "pct2ResTime" : 2576.1499999999996,
    "pct3ResTime" : 3634.59,
    "throughput" : 0.07147755127665906,
    "receivedKBytesPerSec" : 0.03735520625939734,
    "sentKBytesPerSec" : 0.018716750411526168
  },
  "POST /api/explain-error" : {
    "transaction" : "POST /api/explain-error",
    "sampleCount" : 410,
    "errorCount" : 5,
    "errorPct" : 1.2195122,
    "meanResTime" : 2310.246341463415,
    "medianResTime" : 2181.0,
    "minResTime" : 1622.0,
    "maxResTime" : 9045.0,
    "pct1ResTime" : 2801.9000000000005,
    "pct2ResTime" : 3175.5,
    "pct3ResTime" : 5701.979999999992,
    "throughput" : 0.021809213637418313,
    "receivedKBytesPerSec" : 0.014855137252030571,
    "sentKBytesPerSec" : 0.011639286002383906
  },
  "GET source.java" : {
    "transaction" : "GET source.java",
    "sampleCount" : 469,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.618336886993602,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 14.600000000000023,
    "throughput" : 0.024871618169220868,
    "receivedKBytesPerSec" : 0.011187453299426973,
    "sentKBytesPerSec" : 0.0034968462695356885
  }
}